# Subsetting and Descriptive Stats

## Before your start:
   - Remember that you just need to do one of the challenges.
   - Keep in mind that you need to use some of the functions you learned in the previous lessons.
   - All datasets are provided in IronHack's database.
   - Elaborate your codes and outputs as much as you can.
   - Try your best to answer the questions and complete the tasks and most importantly: enjoy the process!
   
#### Import all the necessary libraries here:

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt

import warnings
warnings.filterwarnings("ignore")

# [ONLY ONE MANDATORY] Challenge 1
#### In this challenge we will use the `Temp_States`  dataset. 

#### First import it into a dataframe called `temp`.

In [2]:
temp = pd.read_csv("Temp_states.csv")

#### Print `temp`.

In [3]:
temp

         City        State  Temperature
0         NYC     New York    19.444444
1      Albany     New York     9.444444
2     Buffalo     New York     3.333333
3    Hartford  Connecticut    17.222222
4  Bridgeport  Connecticut    14.444444
5      Treton   New Jersey    22.222222
6      Newark   New Jersey    20.000000

#### Explore the data types of the *temp* dataframe. What types of data do we have? Comment your result.

In [4]:
temp.dtypes

City            object
State           object
Temperature    float64
dtype: object

In [5]:
# We have 2 different types of data
# Temperature is a float
# City and State are both Objects
# Objects can be a mix of strings, floats and integers, but in this case they are all strings

#### Select the rows where state is New York.

In [6]:
temp_newyork = temp[temp["State"] == "New York"]
temp_newyork

      City     State  Temperature
0      NYC  New York    19.444444
1   Albany  New York     9.444444
2  Buffalo  New York     3.333333

#### What is the average temperature of cities in New York?

In [7]:
mean_newyork = temp[temp["State"] == "New York"].agg("mean")
mean_newyork

Temperature    10.740741
dtype: float64

#### Which states and cities have a temperature above 15 degrees Celsius?

In [58]:
temp_15 = temp[temp["Temperature"] >15]
temp_15

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
5    Treton   New Jersey    22.222222
6    Newark   New Jersey    20.000000

#### Now, return only the cities that have a temperature above 15 degrees Celsius.

In [59]:
cities_15 = temp_15["City"]
cities_15

0         NYC
3    Hartford
5      Treton
6      Newark
Name: City, dtype: object

#### Which cities have a temperature above 15 degrees Celcius and below 20 degrees Celsius?

**Hint**: First, write the condition. Then, select the rows.

In [61]:
temp_15_20 = temp[temp["Temperature"].between(15, 20)]
temp_15_20

       City        State  Temperature
0       NYC     New York    19.444444
3  Hartford  Connecticut    17.222222
6    Newark   New Jersey    20.000000

In [62]:
cities_15_20 = temp_15_20["City"]
cities_15_20

0         NYC
3    Hartford
6      Newark
Name: City, dtype: object

#### Find the mean and standard deviation of the temperature of each state.

In [72]:
mean_states = temp.groupby(["State"]).mean("Temperature")
mean_states

             Temperature
State
Connecticut    15.833333
New Jersey     21.111111
New York       10.740741

In [73]:
std_states = temp.groupby(["State"]).std()
std_states

TypeError: an integer is required

# [ONLY ONE MANDATORY]  Challenge 2

#### Load the `employees` dataset into a dataframe. Call the dataframe `employees`.

In [12]:
# your code here

#### Explore the data types of the `employees` dataframe. Comment your results.

In [13]:
# your code here

In [14]:
"""
your comments here
"""

'\nyour comments here\n'

#### What's the average salary in this company?

In [15]:
# your code here

#### What's the highest salary?

In [16]:
# your code here

#### What's the lowest salary?

In [17]:
# your code here

#### Who are the employees with the lowest salary?

In [18]:
# your code here

#### Find all the information about an employee called David.

In [19]:
# your code here

#### Could you return only David's salary?

In [20]:
# your code here

#### Print all the rows where job title is associate.

In [21]:
# your code here

#### Print the first 3 rows of your dataframe.
**Tip**: There are 2 ways to do it. Do it both ways.

In [22]:
# Method 1
# your code here

In [23]:
# Method 2
# your code here

#### Find the employees whose title is associate and whose salary is above 55.

In [24]:
# your code here

#### Group the employees by number of years of employment. What are the average salaries in each group?

In [25]:
# your code here

####  What is the average salary per title?

In [26]:
# your code here

####  Find the salary quartiles.

In [27]:
# your code here

#### Is the mean salary different per gender?

In [28]:
# your code here

#### Find the minimum, mean and maximum of all numeric columns for each company department.

In [29]:
# your code here

#### Bonus Question:  for each department, compute the difference between the maximum and the minimum salary.
**Hint**: try using `agg` or `apply` combined with `lambda` functions.

In [30]:
# your code here

# [ONLY ONE MANDATORY] Challenge 3
#### Open the `Orders` dataset. Name your dataset `orders`.

In [31]:
# your code here

#### Explore your dataset by looking at the data types and summary statistics. Comment your results.

In [32]:
# your code here

In [33]:
"""
your comments here
"""

'\nyour comments here\n'

####  What is the average purchase price?

In [34]:
# your code here

#### What are the highest and lowest purchase prices?

In [35]:
# your code here

#### Select all the customers from Spain.
**Hint**: Remember that you are not asked to find orders from Spain but customers. A customer might have more than one order associated.

In [36]:
# your code here

#### How many customers do we have in Spain?

In [37]:
# your code here

#### Select all the customers who have bought more than 50 items.
**Hint**: Remember that you are not asked to find orders with more than 50 items but customers who bought more than 50 items. A customer with two orders of 30 items each should appear in the selection.

In [38]:
# your code here

#### Select orders from Spain that include more than 50 items.

In [39]:
# your code here

#### Select all free orders.

In [40]:
# your code here

#### Select all orders whose description starts with `lunch bag`.
**Hint**: use string functions.

In [41]:
# your code here

#### Select all `lunch bag` orders made in 2011.

In [42]:
# your code here

#### Show the frequency distribution of the amount spent in Spain.

In [43]:
# your code here

#### Select all orders made in the month of August.

In [44]:
# your code here

#### Find the number of orders made by each country in the month of August.
**Hint**: Use value_counts().

In [45]:
# your code here

#### What's the  average amount of money spent by country?

In [46]:
# your code here

#### What's the most expensive item?

In [47]:
# your code here

#### What is the average amount spent per year?

In [48]:
# your code here